blog-posts/2010-10-30-emacs-keypresses-and-why-keyboard-combinations-arent-that-scary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs, keypresses, and why keyboard combinations aren't that scary</title>
<!-- 2015-01-07 Wed 14:53 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs, keypresses, and why keyboard combinations aren't that scary</h1>
<p>
October 30th, 2010 -
<a href="http://sachachua.com/blog/p/21840"><a href="http://sachachua.com/blog/p/21840">http://sachachua.com/blog/p/21840</a></a>
</p>

<p>
I came across
<a href="http://blog.chrislowis.co.uk/2010/10/26/laptop-driven-development-with-emacs.html">this
comment</a> on Chris Lowis' blog post about small-screen development in
Emacs:
</p>

<blockquote>
<p>
Alex: I can't be geek enough to use Emacs&#x2026; it's not that I think the
 editor is bad: it's the excessive number of keys to press to
 accomplish anything.
</p>
</blockquote>

<p>
It made me stop and think, because one of the things I love about Emacs
is that I can press lots of keys to accomplish anything.
</p>

<p>
What's the alternative? Mouse clicks? Eeew.
</p>

<p>
My most-common keyboard shortcuts are one or two keys long. Yes, there
are many of them, and I use a small subset depending on what I'm working
on. If I forget the keyboard shortcut for something, or I want to run a
command that doesn't have a keyboard shortcut, I use M-x (which is
really Alt-x on my keyboard) to call the function by name (ex: M-x
shell-command-on-region, which turns out to have M-| as a shortcut).
</p>

<p>
I hardly ever type entire function names. <code>icomplete-mode</code> offers
autocompletion for M-x. I also shows me the keyboard shortcuts for a
command in order to help me work more efficiently.
</p>

<p>
If I like something a lot, I can easily define a keyboard shortcut for
it using global-set-key. I can set mode-specific keyboard shortcuts so
that some shortcuts are active when I'm programming and inactive when
I'm not. I can load sets of shortcuts depending on what I want to do.
It's incredibly flexible. Yes, it requires some learning, but it's been
well worth the investment for me.
</p>

<p>
Because you only have so many keys on a keyboard, it's useful to be able
to define multiple-key shortcuts. I'd rather type Ctrl-c r t than
Ctrl-Alt-Shift-R or something like that. (Or worse: spend time looking
for just the right toolbar button, and try to click on it with the
mouse.) I think of it like super-fast selection through a menu that
makes sense to me. In my case, Ctrl-c turned out to be easier to get to
than F9 (which I'd previously been using for personal shortcuts), r
means remember, and t means task.
</p>

<p>
You might think that a keyboard-driven editor is slow, but it's fast
enough to keep up with me, and I can probably code circles around you.
;)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
